import torch

class RMSNorm(torch.nn.Module):
    #Параметры:
    #- d_model: int — скрытая размерность модели
    #- eps: float = 1e-5 — значение эпсилон для численной стабильности
    #- device: torch.device | None = None — устройство для хранения параметров
    #- dtype: torch.dtype | None = None — тип данных параметров
    def __init__(self, d_model: int, eps: float = 1e-5, device=None, dtype=None, *args, **kwargs):

        # 1. Вызываем конструктор суперкласса
        super().__init__(*args, **kwargs)

        self.eps = eps
        # Единичная инициализация: параметр W (размер d_model) заполнен единицами
        self.W = torch.nn.Parameter(torch.ones(d_model, device=device, dtype=dtype))
    
    def forward(self, x: torch.Tensor) -> torch.Tensor:
        x_dtype = x.dtype
        xf32 = x.to(torch.float32)

        # Берем корень из 
        # 1) (возводим числа в квадрат)
        # 2) mean(-1) — вычисляем среднее арифметическое вдоль последней оси (оси с индексом -1). Последняя ось это измерение d_model.
        # [ [1, 2, 3],
        # [4, 5, 6] ] - это двумерный тензор в нем ось -1 это ось 1 - усредняю вдоль оси 1 (по горизонтали), вдоль = мы считаем среднее арифметическое по СТРОКАМ т.е получится 2 числа 
        # Первая строка: (1+2+3)/3 = 2
        # Вторая строка: (4+5+6)/3 = 5
        # если бы считали по ОСИ 0 то было бы вот так
        # Первый столбец (1 + 4)/2 = 2.5
        # Второй столбец (2 + 5)/2 = 3.5
        # Третий столбец (3 + 6)/2 = 4.5
        # 3) keepdim=True означает, что мы сохраняем размерность оси (она становится равна 1), чтобы потом удобно было делить (т.е сохраним размерность). 
        # Без keepdim=True форма результата была бы (batch, seq_len), а с ним — (batch, seq_len, 1)
        # а в примере двумерного массива было бы вот так keepdim=false 
        # [2,5], т.е тензор стал одномерным - размерность (2), при keepdim = true было бы вот так [[2], [5]] - размерность (2,1)
        rms = torch.sqrt(xf32.pow(2).mean(-1, keepdim=True) + self.eps)

        # Тут мы входной тензор (т.е каждый его элемент) делим на усредненное значение, затем умножаем на параметр усиления 
        # И приводим к изначальному типу
        return (xf32/ rms * self.W).to(x_dtype)
